In [33]:
import pandas as pd

Two Core Data Structures

(a) --> Series → 1D labeled array

(b) --> DataFrame → 2D labeled table (like Excel/SQL table)

In [34]:
s = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [35]:
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Salary": [50000, 60000, 70000]
}

df = pd.DataFrame(data)
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [36]:
 # (rows, columns)
print(df.shape)

print("\n")

 # column names
print(df.columns )

print("\n")

# row indexes
print(df.index)

print("\n")

# data types
print(df.dtypes)

print("\n")

# summary
print(df.info())

print("\n")

# statistics (numerical cols only)
print(df.describe())

(3, 3)


Index(['Name', 'Age', 'Salary'], dtype='object')


RangeIndex(start=0, stop=3, step=1)


Name      object
Age        int64
Salary     int64
dtype: object


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Salary  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes
None


        Age   Salary
count   3.0      3.0
mean   30.0  60000.0
std     5.0  10000.0
min    25.0  50000.0
25%    27.5  55000.0
50%    30.0  60000.0
75%    32.5  65000.0
max    35.0  70000.0

Selecting Columns

Single Column
df["Salary"]
Returns a Series.

Multiple Columns
df[["Name", "Salary"]]
Returns a DataFrame.

Selecting Rows

By Index (iloc → integer location)

In [37]:
print(df.iloc[0])
print("\n")
print(df.iloc[0:2])

Name      Alice
Age          25
Salary    50000
Name: 0, dtype: object


    Name  Age  Salary
0  Alice   25   50000
1    Bob   30   60000

By Label (loc → label-based)

In [38]:
print(df.loc[0, "Name"]) # First row, Name column

print("\n")

print(df.loc[0:1, ["Name", "Salary"]])   # First 2 rows, only Name & Salary

Alice


    Name  Salary
0  Alice   50000
1    Bob   60000

Conditional Filtering

In [39]:
df[df["Salary"] > 55000]

      Name  Age  Salary
1      Bob   30   60000
2  Charlie   35   70000

In [40]:
print(df[(df["Salary"] > 55000) & (df["Age"] < 35)])

  Name  Age  Salary
1  Bob   30   60000

Adding New Columns

In [41]:
df["Yearly_Salary"] = df["Salary"] * 12

print(df)

      Name  Age  Salary  Yearly_Salary
0    Alice   25   50000         600000
1      Bob   30   60000         720000
2  Charlie   35   70000         840000

Updating Values

In [42]:
df.loc[1, "Salary"] = 65000

print(df)

      Name  Age  Salary  Yearly_Salary
0    Alice   25   50000         600000
1      Bob   30   65000         720000
2  Charlie   35   70000         840000

Deleting Columns / Rows

inplace = True means to save changes in table

inplace = False means changes cannot be saved in the tabel

axis = 1 , means it is selecting the Whole column
axis = 0 , means it is selection the Whole rows

In [43]:
df.drop("Age", axis=1, inplace=True)   # Drop column
df.drop(2, axis=0, inplace=True)       # Drop row with index 2

print(df)

    Name  Salary  Yearly_Salary
0  Alice   50000         600000
1    Bob   65000         720000

Mini Exercise

Select only the Name and Department columns.

Get all rows where Salary > 60,000.

Add a new column Bonus = 10% of Salary.

Update Bob’s Salary to 62000.

Delete the Age column.

In [44]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, 28],
    "Salary": [50000, 60000, 70000, 65000],
    "Department": ["HR", "IT", "Finance", "IT"]
}
df = pd.DataFrame(data)

print(df)

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000         IT
2  Charlie   35   70000    Finance
3    David   28   65000         IT

In [45]:
print(df[["Name","Department"]])

      Name Department
0    Alice         HR
1      Bob         IT
2  Charlie    Finance
3    David         IT

In [46]:
df2 = df.loc[df['Salary'] > 60000 , ["Name","Department"]]
print(df2)

      Name Department
2  Charlie    Finance
3    David         IT

In [47]:
df2["Bonus"] = (df["Salary"]/100)*10

print(df2)

      Name Department   Bonus
2  Charlie    Finance  7000.0
3    David         IT  6500.0

In [48]:
df.loc[df["Name"] =="Bob" ,"Salary"] =62000

In [49]:
print(df)

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   62000         IT
2  Charlie   35   70000    Finance
3    David   28   65000         IT

In [51]:
df.drop(columns = ["Age"])

      Name  Salary Department
0    Alice   50000         HR
1      Bob   62000         IT
2  Charlie   70000    Finance
3    David   65000         IT

Aggregation & Grouping in Pandas

Aggregation

Aggregation means applying a function (like sum, mean, count, etc.) over rows or columns.

In [54]:
#sum of salary
total_salary = df["Salary"].sum()
print(total_salary)

#average Salary
avg_salary = df["Salary"].mean()
print(avg_salary)

# Minimum and maximum salary
min_salary = df["Salary"].min()
print(min_salary)
max_salary = df["Salary"].max()
print(max_salary)

247000
61750.0
50000
70000

GroupBy

groupby helps you split the data into groups and then apply aggregation functions.

In [55]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank"],
    "Department": ["HR", "IT", "HR", "Finance", "Finance", "IT"],
    "Salary": [50000, 60000, 55000, 65000, 70000, 62000]
}
df = pd.DataFrame(data)

In [58]:
# Average salary per department
print(df.groupby("Department")["Salary"].mean())


print("\n")

# Total salary per department
print(df.groupby("Department")["Salary"].sum())

# Multiple aggregations
df.groupby("Department")["Salary"].agg(["mean", "sum", "min", "max"])

Department
Finance    67500.0
HR         52500.0
IT         61000.0
Name: Salary, dtype: float64


Department
Finance    135000
HR         105000
IT         122000
Name: Salary, dtype: int64

               mean     sum    min    max
Department
Finance     67500.0  135000  65000  70000
HR          52500.0  105000  50000  55000
IT          61000.0  122000  60000  62000

Group by Multiple Columns

In [59]:
df.groupby(["Department", "Name"])["Salary"].sum()

Department  Name
Finance     David      65000
            Eve        70000
HR          Alice      50000
            Charlie    55000
IT          Bob        60000
            Frank      62000
Name: Salary, dtype: int64

Resetting Index

After groupby, you may want to bring the grouped column back as a normal column:

In [60]:
df.groupby("Department")["Salary"].mean().reset_index()

  Department   Salary
0    Finance  67500.0
1         HR  52500.0
2         IT  61000.0

With groupby + agg, you can answer real-world questions like:

Which department has the highest total salary?

What’s the average salary per department?

How many employees are in each department?

Concatenation

Used to stack DataFrames (either rows or columns).

In [62]:
df1 = pd.DataFrame({
    "Name": ["Alice", "Bob"],
    "Salary": [50000, 60000]
})

df2 = pd.DataFrame({
    "Name": ["Charlie", "David"],
    "Salary": [55000, 65000]
})

# Stack rows
display(pd.concat([df1, df2]))

# Stack columns (side by side)
display(pd.concat([df1, df2], axis=1))

      Name  Salary
0    Alice   50000
1      Bob   60000
0  Charlie   55000
1    David   65000

    Name  Salary     Name  Salary
0  Alice   50000  Charlie   55000
1    Bob   60000    David   65000

Merge (like SQL JOIN)

merge works like SQL joins (inner, outer, left, right)

In [64]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"]
})

salaries = pd.DataFrame({
    "EmpID": [1, 2, 4],
    "Salary": [50000, 60000, 70000]
})

# Inner join (only common EmpID)
display(pd.merge(employees, salaries, on="EmpID", how="inner"))
# Left join (all employees, even if salary missing)
display(pd.merge(employees, salaries, on="EmpID", how="left"))

# Outer join (all records, fill NaN if missing)
display(pd.merge(employees, salaries, on="EmpID", how="outer"))

   EmpID   Name  Salary
0      1  Alice   50000
1      2    Bob   60000

   EmpID     Name   Salary
0      1    Alice  50000.0
1      2      Bob  60000.0
2      3  Charlie      NaN

   EmpID     Name   Salary
0      1    Alice  50000.0
1      2      Bob  60000.0
2      3  Charlie      NaN
3      4      NaN  70000.0

Join (shortcut for merging on index)

In [65]:
df1 = pd.DataFrame({"Salary": [50000, 60000]}, index=["Alice", "Bob"])
df2 = pd.DataFrame({"Department": ["HR", "IT"]}, index=["Alice", "Bob"])

df1.join(df2)

       Salary Department
Alice   50000         HR
Bob     60000         IT